CSI API ETABS v1
cDesignConcrete.GetRebarPrefsColumn Method
 Retrieves data from the Rebar Selection Rules for Columns
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetRebarPrefsColumn(
	int Item,
	ref string Value
)
Function GetRebarPrefsColumn (
	Item As Integer,
	ByRef Value As String
) As Integer
Dim instance As cDesignConcrete
Dim Item As Integer
Dim Value As String
Dim returnValue As Integer
returnValue = instance.GetRebarPrefsColumn(Item,
	Value)
int GetRebarPrefsColumn(
	int Item,
	String^% Value
)
abstract GetRebarPrefsColumn :
        Item : int *
        Value : string byref -> int
Parameters
Item
Type: System.Int32
 An integer value corresponding to the data to be retrieved, from the following list
Non-Seismic Smallest Longitudinal Bar Size
Non-Seismic Largest Longitudinal Bar Size
Non-Seismic Smallest Tie Bar Size
Non-Seismic Largest Tie Bar Size
Non-Seismic Min Spacing
Non-Seismic Max Spacing
Seismic Smallest Longitudinal Bar Size
Seismic Largest Longitudinal Bar Size
Seismic Smallest Tie Bar Size
Seismic Largest Tie Bar Size
Seismic Min Spacing
Seismic Max Spacing
Value
Type: System.String
 The retrieved data; note that numerical values are converted to String
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved; otherwise returns non-zero
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value as String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
   'retrieve rebar data
       ret = SapModel.File.GetRebarPrefsColumn(3, Value)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cDesignConcrete Interface
ETABSv1 Namespace